# encoding: UTF-8

#百钱买百鸡的问题算是一套非常经典的不定方程的问题，题目很简单：公鸡5文钱一只，母鸡3文钱一只，小鸡3只一文钱，用100文钱买一百只鸡,其中公鸡，母鸡，小鸡都必须要有，问公鸡，母鸡，小鸡要买多少只刚好凑足100文钱。
# (5x + 3y + z/3) = 100
# (x + y + z) = 100
# 0 < x < 20, 0 < y < 33, z > 0
def count_chicken
  (1...20).each do |x|
    (1...33).each do |y|
      z = 100 - x - y
      puts "x = #{x}, y = #{y}, z = #{z}" if 5 * x + 3 * y + z * 1.0 / 3 == 100
    end
  end
end
count_chicken
# (x + y + z) = 100       ①
# (5x + 3y + z/3) = 100   ②
# 3②-① => 7x + 4y = 100 => y = 25 - 7x/4 
# We can set x = 4k => y = 25 - 7k && z = 75 + 3k
# 0 < x, y, z < 100 => 1 <= k <= 3
def count_chickens
  (1..3).each do |k|
    x = 4 * k
    y = 25 - 7 * k
    z = 75 + 3 * k
    puts "x = #{x}, y = #{y}, z = #{z}"
  end
end
count_chickens


#古代数学巨著《九章算数》中有这么一道题叫“五家共井，甲二绠（汲水用的井绳）不足，如（接上）乙一绠；乙三绠不足，如丙一绠；丙四绠不足，如丁一绠；丁五绠不足，如戊一绠；戊六绠不足，如甲一绠，皆及。
#意思就是说五家人共用一口井，甲家的绳子用两条不够，还要再用乙家的绳子一条才能打到井水；乙家的绳子用三条不够，还要再用丙家的绳子一条才能打到井水；丙家的绳子用四条不够，还要再用丁家的绳子一条才能打到井水；
#丁家的绳子用五条不够，还要再用戊家的绳子一条才能打到井水；戊家的绳子用六条不够，还要再用甲家的绳子一条才能打到井水。最后问：井有多深？每家的绳子各有多长？
# h = 2a + b = 3b + c = 4c + d = 5d + e = 6e + a
# a = b + c/2; b = c + d/3; c = d + e/4; d = e + a/5;
# b = h - 2a, c = h - 3b, d = h - 4c, e = h - 5d, a = h - 6e
# => a = h - 6e = h - 6(h - 5d) = ... = h - 6(h - 5(h - 4(h - 3(h - 2a)))) = 265h - 720a 
# => a = 265h/721, b = 191h/721
def well_height
  
end
well_height

#猴子第一天摘下若干个桃子，当即吃了一半，还不过瘾就多吃了一个。第二天早上又将剩下的桃子吃了一半，还是不过瘾又多吃了一个。以后每天都吃前一天剩下的一半再加一个。到第10天刚好剩一个。问猴子第一天摘了多少个桃子？
# f(n)/2 -1 = f(n + 1) => f(n) = (f(n + 1) + 1) * 2 
def sum_peach(day, total)
  if day == 1
    total
  else
    sum_peach(day - 1, 2 * total + 2)
  end
end
puts sum_peach(10, 1)